export default `詳細
『日本書紀』では日本の初代天皇の神武天皇は神日本磐余彦尊（かむやまといわれひこのみこと）と言われ、饒速日命は「虚空見つ日本の国」と日本を呼んだ。

『新羅本紀』では「670年、倭国が国号を日本と改めた」とされている。「倭」と「日本」の関係について、『日本書紀』によれば、「ヤマト」の勢力が中心に倭を統一した古代の日本では、漢字の流入と共に「倭」を借字として「ヤマト」と読むようになり、やがて、その「ヤマト」に当てる漢字を「倭」から「日本」に変更し、当初はこれを「ヤマト」と読んだとする[16]。

「日本」という国号の表記が定着した時期は、7世紀後半から8世紀初頭までの間と考えられる。この頃の東アジアは、618年に成立した唐が勢力を拡大し、周辺諸国に強い影響を及ぼしていた。斉明天皇は658年臣の阿倍比羅夫に、外国である粛慎（樺太）征伐を命じている。663年の白村江の戦いでの倭国軍の敗戦により、唐は使者を倭国に遣わし、唐と倭国の戦後処理を行っていく過程で、倭国側には唐との対等関係を目指した律令国家に変革していく必要性が生じた。これらの情勢を契機として、668年には天智天皇が日本で最初の律令である近江朝廷之令（近江令）を制定した。そして672年の壬申の乱を経て強い権力を握った天武天皇は、天皇を中心とする体制の構築を更に進め、689年の飛鳥浄御原令から701年（大宝元年）の大宝律令の制定へと至る過程において国号の表記としての「日本」は誕生したと考えられる。

具体的な成立の時点は、史料によって特定されていない。ただし、それを推定する見解は2説に絞られる。

(1) 第一説は、天武天皇の治世（672年 - 686年）に成立したとする説である[58]。これは、この治世に「天皇」の号および表記が成立したと同時期に「日本」という表記も成立したとする見解である。例えば吉田孝は、689年の飛鳥浄御原令で「天皇」表記と「日本」表記と両方が定められたと推測する[59][60]。

(2) もう一説は、701年（大宝元年）の大宝律令の成立の前後に「日本」表記が成立したとする説である。例えば神野志隆光は、大宝令公式令詔書式で「日本」表記が定められたとしている[61]。ただし、『日本書紀』の大化元年（645年）七月条には、高句麗・百済からの使者への詔には「明神御宇日本天皇」とあるが、今日これは、後に定められた大宝律令公式令を元に、『日本書紀』（720年（養老4年）成立）の編者が潤色を加えたものと考えられている[62]。

8世紀前半の唐で成立した『唐暦』には、702年（大宝2年）に「日本国」からの遣使（遣唐使）があったと記されている[63]。後代に成立した『旧唐書』[64][65]、『新唐書』[66] にも、この時の遣唐使によって「日本」という新国号が唐（武則天、大周）へ伝えられたとの記述がある。両書とも「日の出の地に近いことが国号の由来である」とする。国号の変更理由については「雅でない倭国の名を嫌ったからだ」という日本国側からの説明を記載するものの、倭国と日本国との関係については、単なる国号の変更ではない可能性について言及している。すなわち、『旧唐書』は「小国だった日本が倭国を併合した」とし、『新唐書』は、日本の使者は「倭が国号を日本に変えたとか、倭が日本を併合し国号を奪った」と言っているが疑わしいとしており[67]、同書でも、日本は、隋の開皇末（600年頃）に初めて中国と通じた国であり、古くから交流のあった倭国とは別と捉えられている。また、日本の王の姓は阿毎氏であること、筑紫城にいた神武が大和を征服し天皇となったことなどが記載されている。いずれにせよ、これらの記述により、702年に初めて「日本」国号が唐によって承認されたことが確認できる。

これまでに発見されている「日本」国号が記された最古の実物史料は、開元22年（734年、日本：天平6年）銘の井真成墓誌である[68]。但し2011年7月、祢軍という名の百済人武将の墓誌に「日本」の文字が見つかったという論文が中国で発表された。墓誌は678年制作と考えられており、もしこれが事実であるならば日本という国号の成立は従来説から、さらに遡ることになる[69]。

『旧唐書』・『新唐書』等を理由として「日本」国号は、日本列島を東方に見るという中国大陸からの視点に立った呼称であるとする説がある[70]。平安時代初期に成立した『弘仁私記』序にて、日本国が中国に対して「日の本」、つまり東方に所在することが日本の由来であると説明され、平安時代に数度に渡って行われた『日本書紀』の講読の様子を記す『日本書紀私記』諸本においても中国の視点により名付けられたとする説が採られている[71]。

『隋書』東夷伝に、倭王が隋皇帝への国書に「日出ずる処の天子」と自称したとあり、このときの「日出ずる処」という語句が「日本」国号の淵源となったとする主張もある。しかし、「日出ずる処」について、仏典『大智度論』に東方の別表現である旨の記述があるため、現在、単に文飾に過ぎないとする指摘もある[72]。`;
